#+TITLE: Abbreviations

# Copyright (C) 2020 Corwin Brust, Erik C. Elmshauser, Jon Lincicum, Hope Christiansen

#+PROPERTIES:
 :Version: 0.01
 :Author: Erik C Elmshauser
 :Created: 2020/01/11
 :END:

This file is a part of dungeon-mode.  It is not a part of GNU Emacs.
This softare is released under the GNU Public Licence version three
or, at your discretion, any newer version of the GNU Public
License.  For specific terms please see [[LICENSE]] at end-of-file.

THIS IS BADLY BROKEN :)

* Common


# *** comment this works

#+latex_header: \usepackage{pifont}
#+latex_header: \DeclareFontFamily{U}{dice3d}{}
#+latex_header: \DeclareFontShape{U}{dice3d}{m}{n}{<-> s*[4] dice3d}{}

# #+latex: {\usefont{U}{dice3d}{m}{n}3d 3d}


** COMMENT setup
#+begin_src emacs-lisp :results silent
  (setq org-babel-latex-htlatex "htlatex")
  (defmacro by-backend (&rest body)
    `(case (if (boundp 'backend) (org-export-backend-name backend) nil) ,@body))
#+end_src

** test

#+name: my-dice
#+header: :file (by-backend (html "die.svg") (t 'nil))
#+header: :imagemagick
#+header: :results (by-backend (pdf "latex") (t "raw"))
#+begin_src latex
{\usefont{U}{dice3d}{m}{n}3d 3d}
#+end_src

#+RESULTS: my-dice
{\usefont{U}{dice3d}{m}{n}3d 3d}

#+begin_src latex :noweb yes
<<my-dice()>>
#+end_src

#+RESULTS:
#+begin_export latex
{\usefont{U}{dice3d}{m}{n}3d 3d}
#+end_export

# #+latex:

# #+latex: {\usefont{U}{dice3d}{m}{n}3d 3d}

# *** comment this doesn't

# #+latex_header: \usepackage{threedice}

# \die{face-6}

These abbreviations are global meaning entries not providing a legend
are referencing this table where terms intersect, or do not intersect
with any provided legend.

# #+latex_header: \usepackage{pifont}\DeclareFontFamily{U}{⟨name⟩}{}\DeclareFontShape{U}{⟨name⟩}{m}{n}{<->⟨font⟩}{}

*** RAW \Pisymbol{hands}{65}

header

# #+latex: \Pisymbol{hands}{65}

\pi

* Table

| Abbreviation      | Documentation                                                                              | Notes |
|-------------------+--------------------------------------------------------------------------------------------+-------|
| 2d, 2d6, roll     | Players roll 2D6 together                                                                  |       |
| Low Doubles, LowD | \Pisymbol{dice3d}{49} \Pisymbol{dice3d}{49} or \Pisymbol{dice3d}{50} \Pisymbol{dice3d}{50} |       |
| High Doubles ,HiD | \Pisymbol{dice3d}{53} \Pisymbol{dice3d}{53} or \Pisymbol{dice3d}{54} \Pisymbol{dice3d}{54} |       |
| Snakeyes, Sn      | \Pisymbol{dice3d}{49} \Pisymbol{dice3d}{49}                                                |       |
| BoxCars, Bx, Box  | \Pisymbol{dice3d}{54} \Pisymbol{dice3d}{54}                                                |       |

# \Pisymbol{dice3d}{105}
# http://tug.ctan.org/info/symbols/comprehensive/symbols-letter.pdf

* COMMENT org-mode configuration

# Local Variables:
# org-latex-inputenc-alist: (("utf8" . "utf8x"))
# eval: (setq org-latex-default-packages-alist (cons '("mathletters" "ucs" nil) org-latex-default-packages-alist))
# End:

* LICENSE

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <https://www.gnu.org/licenses/>.
